//const array = Array(100).fill(null).map(() => Math.floor(Math.random() * 2000 - 1000))

const array = [
  421, 873, -956, -249, 951, -865, 758, 680,
  550, -842, -977, 184, -464, 932, 496, -774,
  411, 77, -42, -894, 130, -682, -41, 950, 48,
  -475, 146, 290, -940, -92, 760, -625, -660, -911,
  -103, 969, 53, 187, -394, -238, -708, 43, 437, 443,
  65, 440, 139, -553, 79, 262, -75, -106, 783, 703,
  400, 14, -833, -709, -845, 925, 768, -133, 221, 698,
  928, 171, -770, -359, 6, -271, 393, -615, 828, 710,
  -712, 433, 389, -65, 846, -116, 359, 299, 383, 188,
  -522, 464, 132, -379, 57, -769, 52, -965, 285, -379,
  952, 569, 809, -125, -622, 424]


/* чтобы не мутировал исходный
* создаем копию исходного массива
*/
// Сортировка чисел
const sortedNumber = array.slice().sort((a, b) => a - b)

// одикаовый массив, точнее ссылки на него
// console.log(array === array.sort()) 

// проблема с буквой Ё - она стоит после алфавита в Unicode
const alphabet = "ВйцукенгшщзхъфывЁапролджэячсмитьбюЁё".split("")

// Сортировка букв
// Intl - internacilization - Collator сравнение строк
const collatore = new Intl.Collator("ru-RU")
const sortedString = alphabet.sort(collatore.compare)



// Сортировка масиива объектов
const users = [
  { name: "Кирилл", age: 33 },
  { name: "Антон", age: 30 },
  { name: "Алексей", age: 44 },
]

// Сортировка масиива объектов по СТРОКАМ
const sortedObjectsString = users.sort((a,b)=>collatore.compare(a.name, b.name))

// Сортировка масиива объектов по ЧИСЛАМ
const sortedObjectsNumbers= users.sort((a,b)=> a.age - b.age)


